import random
from random import randint


#Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой,
#а некоторые – гербом. Определите минимальное число монеток,
#которые нужно перевернуть, чтобы все монетки были повернуты вверх одной
#и той же стороной. Выведите минимальное количество монет,
#которые нужно перевернуть

n = int(input("Введите колличество монет: "))
k = 0
v = 0
res = []
for i in range(n):
    j = (randint(1, 2))
    res.append(j)
    if j == 1:
        k += 1
    elif j == 2:
        v += 1
print(res)
if k > v:
    print(f"Минимальное количество монет, которые нужно перевернуть: {v}")
else:
    print(f"Минимальное количество монет, которые нужно перевернуть: {k}")


#Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
#Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y
#(X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки.
#Он называет сумму этих чисел S и их произведение P.
#Помогите Кате отгадать задуманные Петей числа

n = int(input('Введите сумму двух чисел: '))
m = int(input('Введите произведение чисел: '))
for i in range(n):
    for j in range(n):
        if n == i + j and m == i * j:
            print(f'первое число ="{i}", второе число ="{j}"')
            break


# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k),
# не превосходящие числа N.

n = int(input('Введите число N: '))
i = 0
while 2 ** i <= n:
    print(f' 2 в степени {i} равна {2 ** i}')
    i += 1